In [1]:
test_semantic_model_url = 'https://raw.githubusercontent.com/djouallah/semantic_sql_testing/refs/heads/main/semantic_model.txt' 
questions_url           = 'https://raw.githubusercontent.com/djouallah/semantic_sql_testing/refs/heads/main/questions.json'
SF = 1
output_dir="/tmp/llm"

In [2]:
import requests
import json
import duckdb
import pathlib
import time
import pandas as pd
import re
from   openai import AzureOpenAI, OpenAIError
import datetime
import os

# Generate Data

In [3]:
if SF <1 :
 schema = f"{str(SF).replace('.', '_')}"
else :
 schema = f'DS{SF:02d}'
os.makedirs(output_dir, exist_ok=True)
db_path = output_dir +"/"+ schema +".duckdb"
if not pathlib.Path(db_path).exists():
    con = duckdb.connect(db_path)
    con.sql("SET memory_limit = '14GB' ")
    con.sql(f"CALL dsdgen(sf={SF})")
    con.close()
con = duckdb.connect()
con.sql(f""" attach '{db_path}' as ds(read_only) ; use ds """)
timestamp = datetime.datetime.now().strftime("%Y%m%d_%H%M%S")

# Run Tests

In [4]:
def get_ai_response(user_message, LLM, provider, api_key=None, azure_endpoint=None, azure_api_version=None):
    system_prompt = ""
    try:
        github_response = requests.get(test_semantic_model_url)
        github_response.raise_for_status()
        system_prompt = github_response.text.strip()
    except requests.RequestException as e:
        print(f"Error fetching system prompt from GitHub ({test_semantic_model_url}): {e}")
        return f"Error fetching system prompt: {e}"

    generated_text = None
    data = None

    if provider == "ollama":
        url = 'http://127.0.0.1:11434/api/chat'
        headers = {'Content-Type': 'application/json'}
        payload = {
            'model': LLM,
            'messages': [
                {'role': 'system', 'content': system_prompt},
                {'role': 'user', 'content': user_message}
            ],
            'stream': False
        }
        try:
            response = requests.post(url, headers=headers, json=payload)
            response.raise_for_status()
            data = response.json()
            generated_text = data.get('message', {}).get('content', '')
            if generated_text:
                generated_text = generated_text.replace("<think>", "").replace("</think>", "")
        except requests.RequestException as e:
            return f"Error with Ollama API request: {e}"
        except (KeyError, IndexError, AttributeError) as e:
            return f"Unexpected response format from Ollama: {e}\nFull response data: {data}"

    elif provider == "azure_foundry":
        if not azure_endpoint or not azure_api_version or not api_key:
            return "Azure provider requires 'azure_endpoint', 'azure_api_version', and 'api_key' parameters."

        try:
            client = AzureOpenAI(
                api_version=azure_api_version,
                azure_endpoint=azure_endpoint,
                api_key=api_key,
            )

            response = client.chat.completions.create(
                messages=[
                    {"role": "system", "content": system_prompt},
                    {"role": "user", "content": user_message}
                ],
                model=LLM,
            )

            generated_text = response.choices[0].message.content

        except Exception as e:
            return f"An error occurred with Azure OpenAI: {e}"



    else:
        return f"Unsupported provider for this test setup: {provider}. Supported providers are 'ollama', 'azure_foundry', and 'gemini'."

    if not isinstance(generated_text, str):
         print(f"Generated text is not a string (type: {type(generated_text)}). Cannot clean.")
         if generated_text is None:
              return "Could not retrieve generated text from provider response."
         else:
              return f"Received unexpected output type from {provider}: {type(generated_text)}. Value: {generated_text}"


    cleaned_text = re.sub(r'```(sql|duckdb)?\s*([\s\S]*?)\s*```', r'\2', generated_text, flags=re.IGNORECASE).strip()

    if "```" in cleaned_text or "SELECT " in cleaned_text.upper() or "WITH " in cleaned_text.upper():
         cleaned_text = cleaned_text.replace("```sql", "").replace("```duckdb", "").replace("```", "").strip()


    return cleaned_text

In [5]:
def execute_sql_with_retry(query, test_model,provider, api_key, azure_endpoint, azure_api_version,max_attempts):
    attempt = 1
    current_query = query.strip()

    while attempt <= max_attempts:
        try:
            # Execute the SQL query
            result = con.sql(current_query).df()
            # Return the DataFrame result and the number of attempts
            return result, attempt
        except Exception as e:
            # Catch any exception during execution
            error_message = str(e).lower()

            # Check if the error is likely a syntax, parser, or binder error
            if "syntax" not in error_message and "parser" not in error_message and "binder" not in error_message:
                # If it's a non-syntax error, return the error message and attempts
                return f"Non-syntax error: {e}", attempt

            # If it's a syntax-like error, print attempt info
            print(current_query)
            print(f"Attempt {attempt}/{max_attempts} failed with syntax error: {e}")

            # If max attempts reached, return the final error message and attempts
            if attempt == max_attempts:
                return f"Max attempts reached. Last error: {e}", attempt

            # Prepare message for Gemini to fix the query
            message = (
                f"The following SQL query has a syntax error: '{current_query}'.\n"
                f"Error message: {e}\n"
                f"Please provide the corrected SQL query. Return only the corrected query without explanation."
            )

            # Get corrected query from Gemini
            corrected_query = get_ai_response(message, test_model,provider, api_key, azure_endpoint, azure_api_version)

            # If Gemini returns an error, return that error message and attempts
            if corrected_query.startswith("Error"):
                return f"Failed to get corrected query : {corrected_query}", attempt

            #print(f"Received corrected query")
            # Update current_query with the corrected one and increment attempt
            current_query = corrected_query.strip()
            attempt += 1
    return "Unexpected error or loop termination", attempt

In [6]:
def ask_question(questions, test_model,provider,api_key=None, azure_endpoint=None, azure_api_version=None):
    results_data = [] 
    for i, x in enumerate(questions):
        print(f"Question {i+1}: {x}") # Keep or remove print as needed
        start_time = time.time()
        sql_query_or_error = get_ai_response(x, test_model, provider, api_key, azure_endpoint, azure_api_version)
        print(sql_query_or_error) # Keep or remove print as needed
        query_result_data_json = [] # Initialize as an empty list for JSON result
        attempts_count = None
        error_details = None # Initialize error_details
        if sql_query_or_error is None or sql_query_or_error.startswith("Error"):
            # If get_ai_response returned an error or None, store the error string
            error_message = sql_query_or_error if sql_query_or_error is not None else "AI response was None"
            # print(f"Failed to get query from AI: {error_message}") # Keep or remove print
            # print("Execution: SKIPPED (AI error)") # Keep or remove print
            error_details = f"AI Error: {error_message}" # Store error details
            # query_result_data_json remains empty []
            result_row_count = 0 # Result count is 0 on error
        else:
            # Attempt to execute the SQL query
            # Ensure execute_sql_with_retry returns a DataFrame on success or a string error
            # Pass the test_model to execute_sql_with_retry as it might need it
            result_from_execution, attempts_count = execute_sql_with_retry(sql_query_or_error, test_model,provider,api_key, azure_endpoint, azure_api_version, max_attempts=3)

            display(result_from_execution)
            is_successful = isinstance(result_from_execution, pd.DataFrame)

            if is_successful:
                print("Execution: SUCCESS") # Keep or remove print
                query_result_data_json = result_from_execution.to_dict('records')
                error_details = None # No error details on success
                result_row_count = len(result_from_execution) # Calculate row count
            else:
                print("Execution: FAILED") # Keep or remove print
                #query_result_data_json remains empty []
                error_details = f"Execution Error: {result_from_execution}" # Store error details
                result_row_count = 0 # Result count is 0 on failure


        end_time = time.time()
        duration = round(end_time - start_time, 2)
        print(f"\nExecution Time: {duration:.2f} seconds") # Keep or remove print
        print(f" ############################### ") # Keep or remove print
        results_data.append({
            "model" : test_model,
            "timestamp": timestamp,
            "nbr": i + 1,
            "question": x,
            "duration_s": duration, # Changed key name slightly for JSON convention
            "sql_query": sql_query_or_error, # Store the generated query string (could be AI error)
            "attempts": attempts_count,
            "result": query_result_data_json, # This is now a list of dictionaries
            "result_count": result_row_count, # Use the calculated row count
            "error_details": error_details # Store error details
        })

    os.makedirs(output_dir, exist_ok=True)
    sanitized_model = re.sub(r'[\\/*?:"<>|]', '_', test_model)
    output_filename = f"{timestamp}_{sanitized_model}.json"
    output_path = os.path.join(output_dir, output_filename)
    try:
        with open(output_path, 'w', encoding='utf-8') as f:
            json.dump(results_data, f, indent=4)
        return f"Successfully processed {len(questions)} questions. Results saved to {output_path}"
    except IOError as e:
        return f"Error saving results to {output_path}: {e}"
    except Exception as e:
        return f"An unexpected error occurred during file saving: {e}"

In [7]:
try:
    response = requests.get(questions_url)
    response.raise_for_status()  # Raise an exception for HTTP errors (4xx or 5xx)
    questions = json.loads(response.text)

    print("Successfully retrieved questions:")
except requests.exceptions.RequestException as e:
    print(f"Error retrieving file from GitHub: {e}")
except json.JSONDecodeError as e:
    print(f"Error decoding JSON: {e}")

Successfully retrieved questions:

In [8]:
%%time
ask_question(questions,"gpt-4o","azure_foundry",os.getenv("LLM_API_KEY"), os.getenv("llm_endpoint"),"2025-01-01-preview" )

Question 1: What is the overall total sales revenue?
-- What is the overall total sales revenue?
SELECT
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales_revenue
FROM store_sales AS ss;

   total_sales_revenue
0         5.138666e+09

Execution: SUCCESS

Execution Time: 2.42 seconds
 ###############################
Question 2: What is the total number of items sold across all transactions?
-- Total number of items sold across all transactions
SELECT
    SUM(ss.ss_quantity) AS total_quantity
FROM store_sales AS ss;

   total_quantity
0     138963631.0

Execution: SUCCESS

Execution Time: 1.31 seconds
 ###############################
Question 3: What is the total monetary value of all returned items?
-- What is the total monetary value of all returned items?
SELECT
    SUM(sr.sr_return_amt) AS total_returns
FROM store_returns AS sr;

   total_returns
0   2.708246e+08

Execution: SUCCESS

Execution Time: 1.78 seconds
 ###############################
Question 4: List the names of all stores, order by store name.
-- List the names of all stores, order by store name
SELECT
    s_store_name AS store_name
FROM
    store
ORDER BY
    s_store_name;

   store_name
0        able
1        able
2        anti
3       ation
4         bar
5       cally
6        eing
7        eing
8         ese
9       ought
10      ought
11      ought

Execution: SUCCESS

Execution Time: 2.06 seconds
 ###############################
Question 5: What are the different item categories available? Order alphabetically by category name.
-- What are the different item categories available? Order alphabetically by category name.
SELECT DISTINCT
    i_category
FROM item
ORDER BY i_category;

     i_category
0         Books
1      Children
2   Electronics
3          Home
4       Jewelry
5           Men
6         Music
7         Shoes
8        Sports
9         Women
10         None

Execution: SUCCESS

Execution Time: 2.22 seconds
 ###############################
Question 6: Show total sales revenue for each year, ordered chronologically by year.
-- Show total sales revenue for each year, ordered chronologically by year.
SELECT
    d.d_year AS year,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales -- Corresponds to total_sales measure
FROM store_sales AS ss
INNER JOIN date_dim AS d ON ss.ss_sold_date_sk = d.d_date_sk
GROUP BY d.d_year
ORDER BY d.d_year;

   year   total_sales
0  1998  1.019052e+09
1  1999  1.001289e+09
2  2000  1.024200e+09
3  2001  1.006888e+09
4  2002  1.014024e+09
5  2003  1.109474e+07

Execution: SUCCESS

Execution Time: 2.80 seconds
 ###############################
Question 7: Which store generated the most total sales revenue? (To ensure a deterministic result if there's a tie, you might order by revenue descending and then store name alphabetically).
-- Which store generated the most total sales revenue?
SELECT
    s.s_store_name AS store_name,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
FROM store_sales AS ss
INNER JOIN store AS s
    ON ss.ss_store_sk = s.s_store_sk
GROUP BY s.s_store_name
ORDER BY total_sales DESC, store_name ASC
LIMIT 1;

  store_name   total_sales
0        bar  8.485581e+08

Execution: SUCCESS

Execution Time: 2.27 seconds
 ###############################
Question 8: What is the total quantity of items sold, broken down by item brand? Order by quantity sold descending, and then by brand name alphabetically for ties.
-- What is the total quantity of items sold, broken down by item brand? Order by quantity sold descending, and then by brand name alphabetically for ties.
SELECT
    i.i_brand AS brand,
    SUM(ss.ss_quantity) AS total_quantity
FROM store_sales AS ss
INNER JOIN item AS i ON ss.ss_item_sk = i.i_item_sk
GROUP BY i.i_brand
ORDER BY total_quantity DESC, brand ASC;

                      brand  total_quantity
0        importoedu pack #2       2348242.0
1        edu packscholar #2       2295358.0
2         importoscholar #2       2259448.0
3         exportischolar #2       2258349.0
4         importoimporto #2       2189537.0
..                      ...             ...
708  edu packamalgamalg #12         12791.0
709    scholaramalgamalg #7          8920.0
710      corpamalgamalg #11          6625.0
711      univamalgamalg #12          6081.0
712    scholaramalgamalg #5          5580.0

[713 rows x 2 columns]

Execution: SUCCESS

Execution Time: 1.77 seconds
 ###############################
Question 9: Compare total sales from preferred customers versus non-preferred customers, ordered by total sales
-- Compare total sales from preferred customers versus non-preferred customers, ordered by total sales
SELECT
    c.c_preferred_cust_flag AS preferred_customer_flag,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
FROM store_sales AS ss
JOIN customer AS c
    ON ss.ss_customer_sk = c.c_customer_sk
GROUP BY c.c_preferred_cust_flag
ORDER BY total_sales DESC;

  preferred_customer_flag   total_sales
0                       N  2.493560e+09
1                       Y  2.408850e+09
2                    None  1.749448e+08

Execution: SUCCESS

Execution Time: 2.68 seconds
 ###############################
Question 10: What is the total return amount for each city where stores are located, ordered alphabetically by city name.
-- What is the total return amount for each city where stores are located, ordered alphabetically by city name.
SELECT
    st.s_city AS city,
    SUM(sr.sr_return_amt) AS total_returns
FROM store_returns AS sr
INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
GROUP BY st.s_city
ORDER BY st.s_city;

       city  total_returns
0  Fairview   4.430884e+07
1    Midway   2.215693e+08

Execution: SUCCESS

Execution Time: 2.49 seconds
 ###############################
Question 11: What is the net sales for each store name, order by net sales.
-- What is the net sales for each store name, order by net sales.
WITH store_sales_agg AS (
    SELECT
        st.s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
), store_returns_agg AS (
    SELECT
        st.s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.s_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
)
SELECT
    COALESCE(ss.s_store_name, sr.s_store_name) AS store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales -- Using the net_sales logic
FROM store_sales_agg AS ss
FULL OUTER JOIN store_returns_agg AS sr ON ss.s_store_name = sr.s_store_name
ORDER BY net_sales;
-- What is the net sales for each store name, order by net sales.
WITH store_sales_agg AS (
    SELECT
        st.s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
), store_returns_agg AS (
    SELECT
        st.s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.s_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
)
SELECT
    COALESCE(ss.s_store_name, sr.s_store_name) AS store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales -- Using the net_sales logic
FROM store_sales_agg AS ss
FULL OUTER JOIN store_returns_agg AS sr ON ss.s_store_name = sr.s_store_name
ORDER BY net_sales;
Attempt 1/3 failed with syntax error: Binder Error: Referenced table "sr" not found!
Candidate tables: "ss"
-- What is the net sales for each store name, order by net sales.
WITH store_sales_agg AS (
    SELECT
        st.s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
), store_returns_agg AS (
    SELECT
        st.s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.s_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
)
SELECT
    COALESCE(ss.s_store_name, sr.s_store_name) AS store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales -- Using the net_sales logic
FROM store_sales_agg AS ss
FULL OUTER JOIN store_returns_agg AS sr ON ss.s_store_name = sr.s_store_name
ORDER BY COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0);
Attempt 2/3 failed with syntax error: Binder Error: Referenced table "sr" not found!
Candidate tables: "ss"
-- What is the net sales for each store name, order by net sales.
WITH store_sales_agg AS (
    SELECT
        st.s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
), store_returns_agg AS (
    SELECT
        st.s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.s_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
)
SELECT
    COALESCE(ss.s_store_name, sr.s_store_name) AS store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales -- Using the net_sales logic
FROM store_sales_agg AS ss
FULL OUTER JOIN store_returns_agg AS sr ON ss.s_store_name = sr.s_store_name
ORDER BY COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0);
Attempt 3/3 failed with syntax error: Binder Error: Referenced table "sr" not found!
Candidate tables: "ss"

'Max attempts reached. Last error: Binder Error: Referenced table "sr" not found!\nCandidate tables: "ss"'

Execution: FAILED

Execution Time: 12.38 seconds
 ###############################
Question 12: Calculate the return rate for each item category, ordered alphabetically by item category name.
-- Calculate the return rate for each item category, ordered alphabetically by item category name.
WITH SalesCategory AS (
    SELECT
        i.i_category AS item_category,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales_amt
    FROM store_sales AS ss
    JOIN item AS i
        ON ss.ss_item_sk = i.i_item_sk
    GROUP BY i.i_category
), ReturnsCategory AS (
    SELECT
        i.i_category AS item_category,
        SUM(sr.sr_return_amt) AS total_returns_amt
    FROM store_returns AS sr
    JOIN item AS i
        ON sr.sr_item_sk = i.i_item_sk
    GROUP BY i.i_category
)
SELECT
    COALESCE(sc.item_category, rc.item_category) AS item_category,
    COALESCE(sc.total_sales_amt, 0) AS total_sales,
    COALESCE(rc.total_returns_amt, 0) AS total_returns,
    (COALESCE(rc.total_returns_amt, 0) / NULLIF(COALESCE(sc.total_sales_amt, 0), 0)) * 100 AS return_rate
FROM SalesCategory AS sc
FULL OUTER JOIN ReturnsCategory AS rc
    ON sc.item_category = rc.item_category
ORDER BY item_category;

   item_category   total_sales  total_returns  return_rate
0          Books  5.031496e+08    26551562.67     5.277072
1       Children  5.085669e+08    26725240.19     5.255010
2    Electronics  5.132486e+08    27301499.34     5.319352
3           Home  5.123771e+08    26739164.36     5.218650
4        Jewelry  4.973734e+08    26584955.23     5.345070
5            Men  5.091009e+08    26522813.27     5.209736
6          Music  5.335553e+08    27691381.94     5.189974
7          Shoes  5.266607e+08    27973256.49     5.311438
8         Sports  5.113303e+08    27203606.83     5.320164
9          Women  5.093438e+08    26808449.53     5.263331
10          None  0.000000e+00      722679.40          NaN
11          None  1.395929e+07           0.00     0.000000

Execution: SUCCESS

Execution Time: 30.26 seconds
 ###############################
Question 13: What is the monthly trend of net sales during the year 2001, ordere by net sales.
-- Monthly trend of net sales during the year 2001, ordered by net sales
WITH store_sales_agg AS (
    SELECT
        d.d_moy AS month,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN date_dim AS d ON ss.ss_sold_date_sk = d.d_date_sk
    WHERE d.d_year = 2001
    GROUP BY d.d_moy
), store_returns_agg AS (
    SELECT
        d.d_moy AS month,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN date_dim AS d ON sr.sr_returned_date_sk = d.d_date_sk
    WHERE d.d_year = 2001
    GROUP BY d.d_moy
)
SELECT
    COALESCE(ss.month, sr.month) AS month,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales
FROM store_sales_agg AS ss
FULL OUTER JOIN store_returns_agg AS sr ON ss.month = sr.month
ORDER BY net_sales;

    month     net_sales
0       2  3.934272e+07
1       3  4.125982e+07
2       4  4.408409e+07
3       5  4.489632e+07
4       6  4.542772e+07
5       7  4.813356e+07
6       1  4.886233e+07
7       9  1.037970e+08
8       8  1.068016e+08
9      10  1.098973e+08
10     11  1.563815e+08
11     12  1.656278e+08

Execution: SUCCESS

Execution Time: 3.79 seconds
 ###############################
Question 14: Which customer birth country exhibits the highest average return rate Order by average return rate descending ?
-- Which customer birth country exhibits the highest average return rate? Order by average return rate descending.
WITH SalesByCountry AS (
    SELECT
        c.c_birth_country,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales -- Corresponds to total_sales measure
    FROM store_sales AS ss
    INNER JOIN customer AS c ON ss.ss_customer_sk = c.c_customer_sk
    GROUP BY c.c_birth_country
),
ReturnsByCountry AS (
    SELECT
        c.c_birth_country,
        SUM(sr.sr_return_amt) AS total_returns -- Corresponds to total_returns measure
    FROM store_returns AS sr
    INNER JOIN customer AS c ON sr.sr_customer_sk = c.c_customer_sk
    GROUP BY c.c_birth_country
)
SELECT
    COALESCE(sbc.c_birth_country, rbc.c_birth_country) AS birth_country,
    COALESCE(sbc.total_sales, 0) AS total_sales,
    COALESCE(rbc.total_returns, 0) AS total_returns,
    (COALESCE(rbc.total_returns, 0) / NULLIF(COALESCE(sbc.total_sales, 0), 0)) * 100 AS average_return_rate
FROM SalesByCountry sbc
FULL OUTER JOIN ReturnsByCountry rbc ON sbc.c_birth_country = rbc.c_birth_country
ORDER BY average_return_rate DESC;

        birth_country   total_sales  total_returns  average_return_rate
0                FIJI  2.384176e+07     1419285.49             5.952939
1            BARBADOS  2.270181e+07     1344259.12             5.921375
2    CHRISTMAS ISLAND  2.431222e+07     1439145.65             5.919433
3            ANGUILLA  2.360135e+07     1375611.61             5.828528
4           SRI LANKA  2.504351e+07     1459055.80             5.826083
..                ...           ...            ...                  ...
208            GAMBIA  2.283661e+07     1067706.60             4.675416
209              OMAN  2.359265e+07     1087666.67             4.610193
210         GIBRALTAR  2.371106e+07     1066172.79             4.496520
211              None  1.738668e+08           0.00             0.000000
212              None  0.000000e+00     9037616.82                  NaN

[213 rows x 4 columns]

Execution: SUCCESS

Execution Time: 5.18 seconds
 ###############################
Question 15: List all item product names that have a return rate greater than 5% and their total sales, ordered by item product name alphabetically.
-- List all item product names that have a return rate greater than 5% and their total sales, ordered by item product name alphabetically.
WITH sales_by_item AS (
    SELECT
        i.i_product_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN item AS i ON ss.ss_item_sk = i.i_item_sk
    GROUP BY i.i_product_name
),
returns_by_item AS (
    SELECT
        i.i_product_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN item AS i ON sr.sr_item_sk = i.i_item_sk
    GROUP BY i.i_product_name
)
SELECT
    COALESCE(sales.i_product_name, returns.i_product_name) AS product_name,
    COALESCE(sales.total_sales, 0) AS total_sales,
    (COALESCE(returns.total_returns, 0) / NULLIF(COALESCE(sales.total_sales, 0), 0)) * 100 AS return_rate
FROM sales_by_item AS sales
FULL OUTER JOIN returns_by_item AS returns
  ON sales.i_product_name = returns.i_product_name
WHERE (COALESCE(returns.total_returns, 0) / NULLIF(COALESCE(sales.total_sales, 0), 0)) * 100 > 5
ORDER BY product_name;

                product_name  total_sales  return_rate
0               ableableable     96747.63     8.473779
1           ableableableable    314629.92     7.327825
2      ableableableableought     95953.97     9.468623
3     ableableableationought    349446.50     5.092948
4       ableableablebarought    274503.21     9.880001
...                      ...          ...          ...
8856            pripripriese    566158.31     7.862370
8857          pripripriought    608749.45     6.403819
8858     pripriprioughtought    203744.17     6.171185
8859            pripripripri    229235.84     6.239936
8860       pripripripriought    596719.47     5.409924

[8861 rows x 3 columns]

Execution: SUCCESS

Execution Time: 5.67 seconds
 ###############################
Question 16: For each store, what was the percentage change in net sales between two consecutive recent years (e.g., 2001 and 2002), ordered alphabetically by store name.
-- For each store, the percentage change in net sales between two consecutive recent years (e.g., 2001 and 2002), ordered alphabetically by store name.
WITH store_sales_agg AS (
    SELECT
        st.s_store_name,
        d.d_year,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    INNER JOIN date_dim AS d ON ss.ss_sold_date_sk = d.d_date_sk
    GROUP BY st.s_store_name, d.d_year
),
store_returns_agg AS (
    SELECT
        st.s_store_name,
        d.d_year,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    INNER JOIN date_dim AS d ON sr.sr_returned_date_sk = d.d_date_sk
    GROUP BY st.s_store_name, d.d_year
),
net_sales_by_year AS (
    SELECT
        COALESCE(ss.s_store_name, sr.s_store_name) AS store_name,
        COALESCE(ss.d_year, sr.d_year) AS year,
        COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales
    FROM store_sales_agg AS ss
    FULL OUTER JOIN store_returns_agg AS sr ON ss.s_store_name = sr.s_store_name AND ss.d_year = sr.d_year
),
net_sales_with_lag AS (
    SELECT
        store_name,
        year,
        net_sales,
        LAG(net_sales) OVER (PARTITION BY store_name ORDER BY year) AS prev_year_net_sales
    FROM net_sales_by_year
)
SELECT
    store_name,
    year,
    prev_year_net_sales,
    net_sales,
    CASE
        WHEN prev_year_net_sales IS NOT NULL THEN
            ((net_sales - prev_year_net_sales) / NULLIF(prev_year_net_sales, 0)) * 100
        ELSE NULL
    END AS percentage_change
FROM net_sales_with_lag
WHERE prev_year_net_sales IS NOT NULL
ORDER BY store_name, year;

   store_name  year  prev_year_net_sales     net_sales  percentage_change
0        able  1999         1.641823e+08  1.548381e+08          -5.691408
1        able  2000         1.548381e+08  1.602415e+08           3.489739
2        able  2001         1.602415e+08  1.580534e+08          -1.365482
3        able  2002         1.580534e+08  1.614079e+08           2.122350
4        able  2003         1.614079e+08 -2.162135e+06        -101.339547
5       ation  1999         1.632369e+08  1.584446e+08          -2.935827
6       ation  2000         1.584446e+08  1.624336e+08           2.517630
7       ation  2001         1.624336e+08  1.586114e+08          -2.353133
8       ation  2002         1.586114e+08  1.551498e+08          -2.182444
9       ation  2003         1.551498e+08 -1.751010e+06        -101.128593
10        bar  1999         1.632164e+08  1.599545e+08          -1.998476
11        bar  2000         1.599545e+08  1.612779e+08           0.827327
12        bar  2001         1.612779e+08  1.568555e+08          -2.742081
13        bar  2002         1.568555e+08  1.602850e+08           2.186394
14        bar  2003         1.602850e+08 -1.786819e+06        -101.114776
15       eing  1999         1.627718e+08  1.571033e+08          -3.482488
16       eing  2000         1.571033e+08  1.598400e+08           1.741971
17       eing  2001         1.598400e+08  1.604526e+08           0.383227
18       eing  2002         1.604526e+08  1.600171e+08          -0.271386
19       eing  2003         1.600171e+08 -2.107819e+06        -101.317246
20        ese  1999         1.645797e+08  1.554361e+08          -5.555737
21        ese  2000         1.554361e+08  1.601994e+08           3.064483
22        ese  2001         1.601994e+08  1.590847e+08          -0.695815
23        ese  2002         1.590847e+08  1.603326e+08           0.784431
24        ese  2003         1.603326e+08 -2.125890e+06        -101.325925
25      ought  1999         1.645924e+08  1.562358e+08          -5.077126
26      ought  2000         1.562358e+08  1.617520e+08           3.530720
27      ought  2001         1.617520e+08  1.556969e+08          -3.743444
28      ought  2002         1.556969e+08  1.583371e+08           1.695725
29      ought  2003         1.583371e+08 -2.182464e+06        -101.378365

Execution: SUCCESS

Execution Time: 6.96 seconds
 ###############################
Question 17: What is the return rate for items sold on weekends versus weekdays, broken down by customer age groups (e.g., under 30, 30-45, over 45), ordered by age group.
-- return rate for items sold on weekends versus weekdays, broken down by customer age groups, ordered by age group
WITH SalesAgeWeek AS (
  -- Calculate total sales per customer age group and weekday/weekend
  SELECT
    CASE
      WHEN (d.d_year - c.c_birth_year) < 30 THEN 'Under 30'
      WHEN (d.d_year - c.c_birth_year) BETWEEN 30 AND 45 THEN '30-45'
      WHEN (d.d_year - c.c_birth_year) > 45 THEN 'Over 45'
      ELSE 'Unknown'
    END AS age_group,
    d.d_weekend AS is_weekend,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales_amt
  FROM store_sales AS ss
  JOIN date_dim AS d ON ss.ss_sold_date_sk = d.d_date_sk
  JOIN customer AS c ON ss.ss_customer_sk = c.c_customer_sk
  WHERE c.c_birth_year IS NOT NULL -- Ensure age groups are calculable
  GROUP BY 1, 2
),
ReturnsAgeWeek AS (
  -- Calculate total returns per customer age group and weekday/weekend
  SELECT
    CASE
      WHEN (d.d_year - c.c_birth_year) < 30 THEN 'Under 30'
      WHEN (d.d_year - c.c_birth_year) BETWEEN 30 AND 45 THEN '30-45'
      WHEN (d.d_year - c.c_birth_year) > 45 THEN 'Over 45'
      ELSE 'Unknown'
    END AS age_group,
    d.d_weekend AS is_weekend,
    SUM(sr.sr_return_amt) AS total_returns_amt
  FROM store_returns AS sr
  JOIN date_dim AS d ON sr.sr_returned_date_sk = d.d_date_sk
  JOIN customer AS c ON sr.sr_customer_sk = c.c_customer_sk
  WHERE c.c_birth_year IS NOT NULL -- Ensure age groups are calculable
  GROUP BY 1, 2
)
-- Final calculation to combine sales and returns by age group and day type (weekday/weekend)
SELECT
  COALESCE(sa.age_group, ra.age_group) AS customer_age_group,
  CASE COALESCE(sa.is_weekend, ra.is_weekend)
    WHEN 'Y' THEN 'Weekend'
    WHEN 'N' THEN 'Weekday'
    ELSE 'Unknown'
  END AS day_type,
  COALESCE(sa.total_sales_amt, 0) AS total_sales,
  COALESCE(ra.total_returns_amt, 0) AS total_returns,
  -- Calculate return rate, handling potential division by zero
  (
    COALESCE(ra.total_returns_amt, 0) / NULLIF(COALESCE(sa.total_sales_amt, 0), 0)
  ) * 100 AS return_rate
FROM SalesAgeWeek AS sa
FULL OUTER JOIN ReturnsAgeWeek AS ra
  ON sa.age_group = ra.age_group AND sa.is_weekend = ra.is_weekend
ORDER BY customer_age_group, day_type;

  customer_age_group day_type   total_sales  total_returns  return_rate
0              30-45  Weekday  8.036384e+08    42231793.68     5.255074
1              30-45  Weekend  3.256532e+08    16958203.53     5.207442
2            Over 45  Weekday  1.568486e+09    83036647.81     5.294065
3            Over 45  Weekend  6.254228e+08    32936328.13     5.266250
4           Under 30  Weekday  1.106583e+09    56395803.78     5.096389
5           Under 30  Weekend  4.411807e+08    23060101.47     5.226906

Execution: SUCCESS

Execution Time: 7.78 seconds
 ###############################
Question 18: Which item brand has shown the largest decrease in its return rate when comparing the average rate of 2001 to 2002, specifically for stores located in the 'TN' state? (Order by the decrease in return rate descending, and then by brand name alphabetically for ties).
-- Which item brand has shown the largest decrease in its return rate when comparing the average rate of 2001 to 2002, specifically for stores located in the 'TN' state?
WITH ReturnRate2001 AS (
    SELECT
        i.i_brand,
        (SUM(sr.sr_return_amt) / NULLIF(SUM(ss.ss_sales_price * ss.ss_quantity), 0)) * 100 AS return_rate_2001
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    INNER JOIN date_dim AS d ON sr.sr_returned_date_sk = d.d_date_sk
    INNER JOIN item AS i ON sr.sr_item_sk = i.i_item_sk
    LEFT JOIN store_sales AS ss ON ss.ss_store_sk = st.s_store_sk AND ss.ss_item_sk = i.i_item_sk AND ss.ss_sold_date_sk = d.d_date_sk
    WHERE d.d_year = 2001 AND st.s_state = 'TN'
    GROUP BY i.i_brand
),
ReturnRate2002 AS (
    SELECT
        i.i_brand,
        (SUM(sr.sr_return_amt) / NULLIF(SUM(ss.ss_sales_price * ss.ss_quantity), 0)) * 100 AS return_rate_2002
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    INNER JOIN date_dim AS d ON sr.sr_returned_date_sk = d.d_date_sk
    INNER JOIN item AS i ON sr.sr_item_sk = i.i_item_sk
    LEFT JOIN store_sales AS ss ON ss.ss_store_sk = st.s_store_sk AND ss.ss_item_sk = i.i_item_sk AND ss.ss_sold_date_sk = d.d_date_sk
    WHERE d.d_year = 2002 AND st.s_state = 'TN'
    GROUP BY i.i_brand
)
SELECT
    COALESCE(r2001.i_brand, r2002.i_brand) AS brand_name,
    COALESCE(r2001.return_rate_2001, 0) AS return_rate_2001,
    COALESCE(r2002.return_rate_2002, 0) AS return_rate_2002,
    COALESCE(r2001.return_rate_2001, 0) - COALESCE(r2002.return_rate_2002, 0) AS return_rate_decrease
FROM ReturnRate2001 r2001
FULL OUTER JOIN ReturnRate2002 r2002
    ON r2001.i_brand = r2002.i_brand
ORDER BY
    return_rate_decrease DESC,
    brand_name ASC;

,brand_name,return_rate_2001,return_rate_2002,return_rate_decrease
0,exporticorp #8,904701.764160,13204.884296,891496.879864
1,edu packunivamalg #17,650858.445946,0.000000,650858.445946
2,brandunivamalg #8,196108.623693,0.000000,196108.623693
3,importomaxi #10,92478.122663,2321.971905,90156.150758
4,scholarmaxi #8,91953.443715,5498.180537,86455.263178
...,...,...,...,...
693,amalgbrand #8,687.209828,173225.815951,-172538.606123
694,univamalgamalg #3,0.000000,184610.714286,-184610.714286
695,scholarunivamalg #2,14614.401512,237729.956150,-223115.554638
696,exportiamalgamalg #16,1499.417683,335918.783069,-334419.365386
697,amalgcorp #1,0.000000,573202.100840,-573202.100840

Execution: SUCCESS

Execution Time: 7.92 seconds
 ###############################
Question 19: For each item class, compare the average net sales value per sales transaction between preferred and non-preferred customers. Order by average net sales descending, and then by item class name alphabetically for ties.
-- For each item class, compare the average net sales value per sales transaction between preferred and non-preferred customers
WITH preferred_net_sales AS (
    SELECT
        i.i_class AS item_class,
        c.c_preferred_cust_flag AS preferred_customer_flag,
        AVG(ss.ss_sales_price * ss.ss_quantity) AS avg_net_sales_per_transaction
    FROM store_sales AS ss
    INNER JOIN customer AS c ON ss.ss_customer_sk = c.c_customer_sk
    INNER JOIN item AS i ON ss.ss_item_sk = i.i_item_sk
    GROUP BY i.i_class, c.c_preferred_cust_flag
)
SELECT
    item_class,
    preferred_customer_flag,
    avg_net_sales_per_transaction
FROM preferred_net_sales
ORDER BY
    avg_net_sales_per_transaction DESC,
    item_class ASC;

    item_class preferred_customer_flag  avg_net_sales_per_transaction
0    wallpaper                    None                    2182.882320
1        decor                    None                    2172.952359
2       stereo                    None                    2145.389483
3      fishing                    None                    2100.967304
4       custom                    None                    2078.424679
..         ...                     ...                            ...
295   flatware                    None                    1757.351243
296    musical                    None                    1756.913914
297     sports                    None                    1747.283095
298    camping                    None                    1741.471667
299     tennis                    None                    1734.447058

[300 rows x 3 columns]

Execution: SUCCESS

Execution Time: 3.60 seconds
 ###############################
Question 20: show all stores net sales , average net sales and percentage of net sales compared to average net sales for each store, ordered by percentage of net sales descending.
-- Show all stores net sales, average net sales, and percentage of net sales compared to average net sales for each store, ordered by percentage of net sales descending.
WITH store_sales_agg AS (
    SELECT
        st.s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
), store_returns_agg AS (
    SELECT
        st.s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
), net_sales_by_store AS (
    SELECT
        COALESCE(ss.s_store_name, sr.s_store_name) AS store_name,
        COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales
    FROM store_sales_agg AS ss
    FULL OUTER JOIN store_returns_agg AS sr ON ss.s_store_name = sr.s_store_name
), average_net_sales AS (
    SELECT
        AVG(net_sales) AS avg_net_sales
    FROM net_sales_by_store
)
SELECT
    ns.store_name,
    ns.net_sales,
    avg.avg_net_sales AS average_net_sales,
    (ns.net_sales / NULLIF(avg.avg_net_sales, 0)) * 100 AS percentage_of_net_sales
FROM net_sales_by_store AS ns
CROSS JOIN average_net_sales AS avg
ORDER BY percentage_of_net_sales DESC;

  store_name     net_sales  average_net_sales  percentage_of_net_sales
0        bar  8.044211e+08       8.018329e+08               100.322786
1       eing  8.028028e+08       8.018329e+08               100.120972
2        ese  8.023467e+08       8.018329e+08               100.064083
3       able  8.014186e+08       8.018329e+08                99.948335
4      ation  8.007528e+08       8.018329e+08                99.865304
5      ought  7.992551e+08       8.018329e+08                99.678521

Execution: SUCCESS

Execution Time: 4.80 seconds
 ###############################
CPU times: total: 22.3 s
Wall time: 1min 50s

'Successfully processed 20 questions. Results saved to /tmp/llm\\20250510_144904_gpt-4o.json'

In [9]:
%%time
ask_question(questions,'qwen3:4b',"ollama")

Question 1: What is the overall total sales revenue?
SELECT
  total_sales
FROM (
  SELECT
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
  FROM store_sales AS ss
) AS sales_agg; -- overall total sales revenue

    total_sales
0  5.138666e+09

Execution: SUCCESS

Execution Time: 15.90 seconds
 ###############################
Question 2: What is the total number of items sold across all transactions?
SELECT
  SUM(ss.ss_quantity) AS total_quantity
FROM
  store_sales ss; -- Question: What is the total number of items sold across all transactions?

   total_quantity
0     138963631.0

Execution: SUCCESS

Execution Time: 2.54 seconds
 ###############################
Question 3: What is the total monetary value of all returned items?
-- total monetary value of all returned items
SELECT
  SUM(sr.sr_return_amt) AS total_returns
FROM store_returns sr;

   total_returns
0   2.708246e+08

Execution: SUCCESS

Execution Time: 2.22 seconds
 ###############################
Question 4: List the names of all stores, order by store name.
SELECT s.s_store_name
FROM store s
ORDER BY s.s_store_name;

   s_store_name
0          able
1          able
2          anti
3         ation
4           bar
5         cally
6          eing
7          eing
8           ese
9         ought
10        ought
11        ought

Execution: SUCCESS

Execution Time: 1.60 seconds
 ###############################
Question 5: What are the different item categories available? Order alphabetically by category name.
SELECT i_category
FROM item
ORDER BY i_category;

      i_category
0          Books
1          Books
2          Books
3          Books
4          Books
...          ...
17995       None
17996       None
17997       None
17998       None
17999       None

[18000 rows x 1 columns]

Execution: SUCCESS

Execution Time: 1.47 seconds
 ###############################
Question 6: Show total sales revenue for each year, ordered chronologically by year.
SELECT
  d.d_year AS year,
  SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
FROM
  store_sales ss
JOIN
  date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
GROUP BY
  d.d_year
ORDER BY
  d.d_year;

   year   total_sales
0  1998  1.019052e+09
1  1999  1.001289e+09
2  2000  1.024200e+09
3  2001  1.006888e+09
4  2002  1.014024e+09
5  2003  1.109474e+07

Execution: SUCCESS

Execution Time: 4.43 seconds
 ###############################
Question 7: Which store generated the most total sales revenue? (To ensure a deterministic result if there's a tie, you might order by revenue descending and then store name alphabetically).
SELECT
  st.s_store_name,
  SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
FROM store_sales AS ss
JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
GROUP BY st.s_store_name
ORDER BY total_sales DESC, st.s_store_name;

  s_store_name   total_sales
0          bar  8.485581e+08
1         eing  8.471117e+08
2          ese  8.462294e+08
3         able  8.459570e+08
4        ation  8.452357e+08
5        ought  8.437834e+08

Execution: SUCCESS

Execution Time: 4.16 seconds
 ###############################
Question 8: What is the total quantity of items sold, broken down by item brand? Order by quantity sold descending, and then by brand name alphabetically for ties.
SELECT
  i.i_brand,
  SUM(ss.ss_quantity) AS total_quantity
FROM
  store_sales ss
JOIN
  item i ON ss.ss_item_sk = i.i_item_sk
GROUP BY
  i.i_brand
ORDER BY
  total_quantity DESC,
  i.i_brand;

                    i_brand  total_quantity
0        importoedu pack #2       2348242.0
1        edu packscholar #2       2295358.0
2         importoscholar #2       2259448.0
3         exportischolar #2       2258349.0
4         importoimporto #2       2189537.0
..                      ...             ...
708  edu packamalgamalg #12         12791.0
709    scholaramalgamalg #7          8920.0
710      corpamalgamalg #11          6625.0
711      univamalgamalg #12          6081.0
712    scholaramalgamalg #5          5580.0

[713 rows x 2 columns]

Execution: SUCCESS

Execution Time: 4.17 seconds
 ###############################
Question 9: Compare total sales from preferred customers versus non-preferred customers, ordered by total sales
SELECT
  'Preferred' AS customer_type,
  SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
FROM store_sales AS ss
JOIN customer AS c ON ss.ss_customer_sk = c.c_customer_sk
WHERE c.c_preferred_cust_flag = 'Y'

UNION ALL

SELECT
  'Non-Preferred' AS customer_type,
  SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
FROM store_sales AS ss
JOIN customer AS c ON ss.ss_customer_sk = c.c_customer_sk
WHERE c.c_preferred_cust_flag = 'N'
ORDER BY total_sales DESC;

   customer_type   total_sales
0  Non-Preferred  2.493560e+09
1      Preferred  2.408850e+09

Execution: SUCCESS

Execution Time: 8.06 seconds
 ###############################
Question 10: What is the total return amount for each city where stores are located, ordered alphabetically by city name.
SELECT
  st.s_city AS city,
  SUM(sr.sr_return_amt) AS total_return_amount
FROM store_returns AS sr
JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
GROUP BY st.s_city
ORDER BY st.s_city;

       city  total_return_amount
0  Fairview         4.430884e+07
1    Midway         2.215693e+08

Execution: SUCCESS

Execution Time: 3.87 seconds
 ###############################
Question 11: What is the net sales for each store name, order by net sales.
SELECT
    st.s_store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales
FROM (
    SELECT
        s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales ss
    INNER JOIN store st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY s_store_name
) ss
FULL OUTER JOIN (
    SELECT
        s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns sr
    INNER JOIN store st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY s_store_name
) sr ON ss.s_store_name = sr.s_store_name
ORDER BY net_sales;
SELECT
    st.s_store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales
FROM (
    SELECT
        s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales ss
    INNER JOIN store st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY s_store_name
) ss
FULL OUTER JOIN (
    SELECT
        s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns sr
    INNER JOIN store st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY s_store_name
) sr ON ss.s_store_name = sr.s_store_name
ORDER BY net_sales;
Attempt 1/3 failed with syntax error: Binder Error: Referenced table "st" not found!
Candidate tables: "ss", "sr"
SELECT
    st.s_store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales
FROM (
    SELECT
        st.s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales ss
    INNER JOIN store st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
) ss
FULL OUTER JOIN (
    SELECT
        st.s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns sr
    INNER JOIN store st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
) sr ON ss.s_store_name = sr.s_store_name
ORDER BY net_sales;
Attempt 2/3 failed with syntax error: Binder Error: Referenced table "st" not found!
Candidate tables: "ss", "sr"
SELECT
    st.s_store_name,
    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales
FROM (
    SELECT
        st.s_store_name,
        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales ss
    INNER JOIN store st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
) ss
FULL OUTER JOIN (
    SELECT
        st.s_store_name,
        SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns sr
    INNER JOIN store st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY st.s_store_name
) sr ON ss.s_store_name = sr.s_store_name
ORDER BY net_sales;
Attempt 3/3 failed with syntax error: Binder Error: Referenced table "st" not found!
Candidate tables: "ss", "sr"

'Max attempts reached. Last error: Binder Error: Referenced table "st" not found!\nCandidate tables: "ss", "sr"'

Execution: FAILED

Execution Time: 31.59 seconds
 ###############################
Question 12: Calculate the return rate for each item category, ordered alphabetically by item category name.
SELECT
  i.i_category,
  (COALESCE(SR.total_returns, 0) / NULLIF(COALESCE(SS.total_sales, 0), 0)) * 100 AS return_rate
FROM
  (SELECT
    SUM(sr.sr_return_amt) AS total_returns
  FROM
    store_returns sr
  JOIN
    date_dim d ON sr.sr_returned_date_sk = d.d_date_sk
  JOIN
    item i ON sr.sr_item_sk = i.i_item_sk
  GROUP BY
    i.i_category) SR
FULL OUTER JOIN
  (SELECT
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
  FROM
    store_sales ss
  JOIN
    date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
  JOIN
    item i ON ss.ss_item_sk = i.i_item_sk
  GROUP BY
    i.i_category) SS
ON SR.i_category = SS.i_category
ORDER BY
  i.i_category;
SELECT
  i.i_category,
  (COALESCE(SR.total_returns, 0) / NULLIF(COALESCE(SS.total_sales, 0), 0)) * 100 AS return_rate
FROM
  (SELECT
    SUM(sr.sr_return_amt) AS total_returns
  FROM
    store_returns sr
  JOIN
    date_dim d ON sr.sr_returned_date_sk = d.d_date_sk
  JOIN
    item i ON sr.sr_item_sk = i.i_item_sk
  GROUP BY
    i.i_category) SR
FULL OUTER JOIN
  (SELECT
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
  FROM
    store_sales ss
  JOIN
    date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
  JOIN
    item i ON ss.ss_item_sk = i.i_item_sk
  GROUP BY
    i.i_category) SS
ON SR.i_category = SS.i_category
ORDER BY
  i.i_category;
Attempt 1/3 failed with syntax error: Binder Error: Values list "SR" does not have a column named "i_category"
SELECT
  i.i_category,
  (COALESCE(SR.total_returns, 0) / NULLIF(COALESCE(SS.total_sales, 0), 0)) * 100 AS return_rate
FROM
  (SELECT
    i.i_category,
    SUM(sr.sr_return_amt) AS total_returns
  FROM
    store_returns sr
  JOIN
    date_dim d ON sr.sr_returned_date_sk = d.d_date_sk
  JOIN
    item i ON sr.sr_item_sk = i.i_item_sk
  GROUP BY
    i.i_category) SR
FULL OUTER JOIN
  (SELECT
    i.i_category,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
  FROM
    store_sales ss
  JOIN
    date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
  JOIN
    item i ON ss.ss_item_sk = i.i_item_sk
  GROUP BY
    i.i_category) SS
ON SR.i_category = SS.i_category
ORDER BY
  i.i_category;
Attempt 2/3 failed with syntax error: Binder Error: Referenced table "i" not found!
Candidate tables: "SR"

     i_category  return_rate
0         Books     5.234395
1      Children     5.222250
2   Electronics     5.292227
3          Home     5.186569
4       Jewelry     5.319317
5           Men     5.173270
6         Music     5.165041
7         Shoes     5.299957
8        Sports     5.284389
9         Women     5.220065
10         None     0.000000
11         None          NaN

Execution: SUCCESS

Execution Time: 42.23 seconds
 ###############################
Question 13: What is the monthly trend of net sales during the year 2001, ordere by net sales.
SELECT
  d.d_moy AS month,
  (COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) AS net_sales
FROM date_dim d
LEFT JOIN (
  SELECT
    d.d_date_sk,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
  FROM store_sales ss
  JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
  WHERE d.d_year = 2001
  GROUP BY d.d_date_sk
) ss ON d.d_date_sk = ss.d_date_sk
LEFT JOIN (
  SELECT
    d.d_date_sk,
    SUM(sr.sr_return_amt) AS total_returns
  FROM store_returns sr
  JOIN date_dim d ON sr.sr_returned_date_sk = d.d_date_sk
  WHERE d.d_year = 2001
  GROUP BY d.d_date_sk
) sr ON d.d_date_sk = sr.d_date_sk
WHERE d.d_year = 2001
ORDER BY net_sales;

     month   net_sales
0        3  -231302.77
1        2   916177.22
2        4   929991.06
3        1   934605.51
4        2  1022235.79
..     ...         ...
360     12  5868768.60
361     12  5920981.43
362     11  5926100.80
363     11  6093391.10
364     12  6153941.71

[365 rows x 2 columns]

Execution: SUCCESS

Execution Time: 14.21 seconds
 ###############################
Question 14: Which customer birth country exhibits the highest average return rate Order by average return rate descending ?
SELECT
  c.c_birth_country,
  AVG( (sr.sr_return_amt / NULLIF(ss.total_sales_amt, 0)) * 100 ) AS average_return_rate
FROM
  customer c
JOIN
  (SELECT
    ss.ss_customer_sk,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales_amt
  FROM
    store_sales ss
  GROUP BY
    ss.ss_customer_sk) ss
ON
  c.c_customer_sk = ss.ss_customer_sk
JOIN
  (SELECT
    sr.sr_customer_sk,
    SUM(sr.sr_return_amt) AS total_returns_amt
  FROM
    store_returns sr
  GROUP BY
    sr.sr_customer_sk) sr
ON
  c.c_customer_sk = sr.sr_customer_sk
GROUP BY
  c.c_birth_country
ORDER BY
  average_return_rate DESC;
SELECT
  c.c_birth_country,
  AVG( (sr.sr_return_amt / NULLIF(ss.total_sales_amt, 0)) * 100 ) AS average_return_rate
FROM
  customer c
JOIN
  (SELECT
    ss.ss_customer_sk,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales_amt
  FROM
    store_sales ss
  GROUP BY
    ss.ss_customer_sk) ss
ON
  c.c_customer_sk = ss.ss_customer_sk
JOIN
  (SELECT
    sr.sr_customer_sk,
    SUM(sr.sr_return_amt) AS total_returns_amt
  FROM
    store_returns sr
  GROUP BY
    sr.sr_customer_sk) sr
ON
  c.c_customer_sk = sr.sr_customer_sk
GROUP BY
  c.c_birth_country
ORDER BY
  average_return_rate DESC;
Attempt 1/3 failed with syntax error: Binder Error: Values list "sr" does not have a column named "sr_return_amt"

    c_birth_country  average_return_rate
0           SENEGAL             7.265962
1            TURKEY             7.246822
2           ESTONIA             7.190027
3          SLOVENIA             7.188294
4           DENMARK             7.183546
..              ...                  ...
207          SERBIA             5.595224
208          MALAWI             5.590953
209           CHILE             5.583746
210   NEW CALEDONIA             5.568903
211            OMAN             5.447704

[212 rows x 2 columns]

Execution: SUCCESS

Execution Time: 23.65 seconds
 ###############################
Question 15: List all item product names that have a return rate greater than 5% and their total sales, ordered by item product name alphabetically.
SELECT
  i.i_product_name,
  SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
FROM
  store_sales ss
JOIN
  date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
JOIN
  store st ON ss.ss_store_sk = st.s_store_sk
JOIN
  customer c ON ss.ss_customer_sk = c.c_customer_sk
JOIN
  item i ON ss.ss_item_sk = i.i_item_sk
LEFT JOIN
  store_returns sr ON ss.ss_item_sk = sr.sr_item_sk AND ss.ss_store_sk = sr.sr_store_sk AND ss.ss_customer_sk = sr.sr_customer_sk AND ss.ss_sold_date_sk = sr.sr_returned_date_sk
GROUP BY
  i.i_product_name
HAVING
  (COALESCE(SUM(sr.sr_return_amt), 0) / NULLIF(SUM(ss.ss_sales_price * ss.ss_quantity), 0)) * 100 > 5
ORDER BY
  i.i_product_name;

Empty DataFrame
Columns: [i_product_name, total_sales]
Index: []

Execution: SUCCESS

Execution Time: 13.90 seconds
 ###############################
Question 16: For each store, what was the percentage change in net sales between two consecutive recent years (e.g., 2001 and 2002), ordered alphabetically by store name.
SELECT
  st.s_store_name,
  (COALESCE(ss2.total_sales, 0) - COALESCE(ss1.total_sales, 0)) * 100.0 / COALESCE(ss1.total_sales, 1) AS percentage_change
FROM store AS st
JOIN (
  SELECT
    s_store_sk,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
  FROM store_sales AS ss
  JOIN store AS s ON ss.ss_store_sk = s.s_store_sk
  GROUP BY s_store_sk
) AS ss1 ON st.s_store_sk = ss1.s_store_sk
JOIN (
  SELECT
    s_store_sk,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
  FROM store_sales AS ss
  JOIN store AS s ON ss.ss_store_sk = s.s_store_sk
  GROUP BY s_store_sk
) AS ss2 ON st.s_store_sk = ss2.s_store_sk
ORDER BY st.s_store_name;

  s_store_name  percentage_change
0         able                0.0
1        ation                0.0
2          bar                0.0
3         eing                0.0
4          ese                0.0
5        ought                0.0

Execution: SUCCESS

Execution Time: 13.04 seconds
 ###############################
Question 17: What is the return rate for items sold on weekends versus weekdays, broken down by customer age groups (e.g., under 30, 30-45, over 45), ordered by age group.
SELECT
  COALESCE(sa.age_group, ra.age_group) AS customer_age_group,
  COALESCE(sa.total_sales_amt, 0) AS total_sales,
  COALESCE(ra.total_returns_amt, 0) AS total_returns,
  (
    COALESCE(ra.total_returns_amt, 0) / NULLIF(COALESCE(sa.total_sales_amt, 0), 0)
  ) * 100 AS return_rate,
  sa.d_weekend AS is_weekend
FROM (
  SELECT
    CASE
      WHEN (
        d.d_year - c.c_birth_year
      ) < 20 THEN '< 20'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 20 AND 29 THEN '20-29'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 30 AND 39 THEN '30-39'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 40 AND 49 THEN '40-49'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 50 AND 59 THEN '50-59'
      WHEN (
        d.d_year - c.c_birth_year
      ) >= 60 THEN '60+'
      ELSE 'Unknown'
    END AS age_group,
    SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales_amt,
    d.d_weekend
  FROM store_sales AS ss
  JOIN date_dim AS d ON ss.ss_sold_date_sk = d.d_date_sk
  JOIN customer AS c ON ss.ss_customer_sk = c.c_customer_sk
  WHERE
    c.c_birth_year IS NOT NULL AND d.d_year IS NOT NULL
  GROUP BY
    1,
    d.d_weekend
) sa
FULL OUTER JOIN (
  SELECT
    CASE
      WHEN (
        d.d_year - c.c_birth_year
      ) < 20 THEN '< 20'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 20 AND 29 THEN '20-29'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 30 AND 39 THEN '30-39'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 40 AND 49 THEN '40-49'
      WHEN (
        d.d_year - c.c_birth_year
      ) BETWEEN 50 AND 59 THEN '50-59'
      WHEN (
        d.d_year - c.c_birth_year
      ) >= 60 THEN '60+'
      ELSE 'Unknown'
    END AS age_group,
    SUM(sr.sr_return_amt) AS total_returns_amt
  FROM store_returns AS sr
  JOIN date_dim AS d ON sr.sr_returned_date_sk = d.d_date_sk
  JOIN customer AS c ON sr.sr_customer_sk = c.c_customer_sk
  WHERE
    c.c_birth_year IS NOT NULL AND d.d_year IS NOT NULL
  GROUP BY
    1
) ra
ON sa.age_group = ra.age_group
ORDER BY customer_age_group;

   customer_age_group   total_sales  total_returns  return_rate is_weekend
0               20-29  5.098070e+08    37435291.60     7.343032          N
1               20-29  2.025206e+08    37435291.60    18.484687          Y
2               30-39  5.036592e+08    37371720.46     7.420042          N
3               30-39  2.044319e+08    37371720.46    18.280765          Y
4               40-49  5.053419e+08    36841798.86     7.290469          N
5               40-49  2.025687e+08    36841798.86    18.187314          Y
6               50-59  2.029946e+08    37191421.11    18.321381          Y
7               50-59  5.058094e+08    37191421.11     7.352852          N
8                 60+  8.573134e+08    63758032.72     7.436958          N
9                 60+  3.410808e+08    63758032.72    18.692940          Y
10               < 20  5.967765e+08    42020613.65     7.041265          N
11               < 20  2.386602e+08    42020613.65    17.606880          Y

Execution: SUCCESS

Execution Time: 42.88 seconds
 ###############################
Question 18: Which item brand has shown the largest decrease in its return rate when comparing the average rate of 2001 to 2002, specifically for stores located in the 'TN' state? (Order by the decrease in return rate descending, and then by brand name alphabetically for ties).
SELECT
  i.i_brand,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2001,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2002,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) - (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS decrease_in_return_rate
FROM item i
WHERE i.i_item_sk IN (
  SELECT DISTINCT ss.ss_item_sk
  FROM store_sales ss
  JOIN store s ON ss.ss_store_sk = s.s_store_sk
  WHERE s.s_state = 'TN' AND ss.ss_sold_date_sk IN (
    SELECT d.d_date_sk
    FROM date_dim d
    WHERE d.d_year = 2001
  )
)
ORDER BY decrease_in_return_rate DESC, i.i_brand;
SELECT
  i.i_brand,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2001,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2002,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) - (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_sales ss
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   JOIN item i ON ss.ss_item_sk = i.i_item_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS decrease_in_return_rate
FROM item i
WHERE i.i_item_sk IN (
  SELECT DISTINCT ss.ss_item_sk
  FROM store_sales ss
  JOIN store s ON ss.ss_store_sk = s.s_store_sk
  WHERE s.s_state = 'TN' AND ss.ss_sold_date_sk IN (
    SELECT d.d_date_sk
    FROM date_dim d
    WHERE d.d_year = 2001
  )
)
ORDER BY decrease_in_return_rate DESC, i.i_brand;
Attempt 1/3 failed with syntax error: Binder Error: Referenced table "sr" not found!
Candidate tables: "i"
SELECT
  i.i_brand,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2001,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2002,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) - (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS decrease_in_return_rate
FROM item i
WHERE i.i_item_sk IN (
  SELECT DISTINCT ss.ss_item_sk
  FROM store_sales ss
  JOIN store s ON ss.ss_store_sk = s.s_store_sk
  WHERE s.s_state = 'TN' AND ss.ss_sold_date_sk IN (
    SELECT d.d_date_sk
    FROM date_dim d
    WHERE d.d_year = 2001
  )
)
ORDER BY decrease_in_return_rate DESC, i.i_brand;
Attempt 2/3 failed with syntax error: Binder Error: Referenced table "ss" not found!
Candidate tables: "i"
SELECT
  i.i_brand,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2001,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2002,
  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2001
   AND ss.ss_item_sk = i.i_item_sk) - (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100
   FROM store_returns sr
   JOIN store_sales ss ON sr.sr_store_sk = ss.ss_store_sk AND sr.sr_item_sk = ss.ss_item_sk
   JOIN store s ON ss.ss_store_sk = s.s_store_sk
   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk
   WHERE s.s_state = 'TN' AND d.d_year = 2002
   AND ss.ss_item_sk = i.i_item_sk) AS decrease_in_return_rate
FROM item i
WHERE i.i_item_sk IN (
  SELECT DISTINCT ss.ss_item_sk
  FROM store_sales ss
  JOIN store s ON ss.ss_store_sk = s.s_store_sk
  WHERE s.s_state = 'TN' AND ss.ss_sold_date_sk IN (
    SELECT d.d_date_sk
    FROM date_dim d
    WHERE d.d_year = 2001
  )
) ORDER BY decrease_in_return_rate DESC, i.i_brand;
Attempt 3/3 failed with syntax error: Binder Error: Referenced table "ss" not found!
Candidate tables: "i"

'Max attempts reached. Last error: Binder Error: Referenced table "ss" not found!\nCandidate tables: "i"'

Execution: FAILED

Execution Time: 122.17 seconds
 ###############################
Question 19: For each item class, compare the average net sales value per sales transaction between preferred and non-preferred customers. Order by average net sales descending, and then by item class name alphabetically for ties.
SELECT
    i.i_class,
    COALESCE(p.preferred_avg_net_sales, 0) AS preferred_avg_net_sales,
    COALESCE(np.non_preferred_avg_net_sales, 0) AS non_preferred_avg_net_sales
FROM
    item i
LEFT JOIN (
    SELECT
        c.c_preferred_cust_flag,
        AVG(ss.ss_sales_price * ss.ss_quantity) AS avg_net_sales
    FROM
        store_sales ss
    JOIN
        customer c ON ss.ss_customer_sk = c.c_customer_sk
    JOIN
        item i ON ss.ss_item_sk = i.i_item_sk
    WHERE
        c.c_preferred_cust_flag = 'Y'
    GROUP BY
        c.c_preferred_cust_flag
) preferred ON i.i_class = preferred.avg_net_sales
LEFT JOIN (
    SELECT
        c.c_preferred_cust_flag,
        AVG(ss.ss_sales_price * ss.ss_quantity) AS avg_net_sales
    FROM
        store_sales ss
    JOIN
        customer c ON ss.ss_customer_sk = c.c_customer_sk
    JOIN
        item i ON ss.ss_item_sk = i.i_item_sk
    WHERE
        c.c_preferred_cust_flag = 'N'
    GROUP BY
        c.c_preferred_cust_flag
) non_preferred ON i.i_class = non_preferred.avg_net_sales
ORDER BY
    preferred_avg_net_sales DESC,
    i.i_class;
SELECT
    i.i_class,
    COALESCE(p.preferred_avg_net_sales, 0) AS preferred_avg_net_sales,
    COALESCE(np.non_preferred_avg_net_sales, 0) AS non_preferred_avg_net_sales
FROM
    item i
LEFT JOIN (
    SELECT
        c.c_preferred_cust_flag,
        AVG(ss.ss_sales_price * ss.ss_quantity) AS avg_net_sales
    FROM
        store_sales ss
    JOIN
        customer c ON ss.ss_customer_sk = c.c_customer_sk
    JOIN
        item i ON ss.ss_item_sk = i.i_item_sk
    WHERE
        c.c_preferred_cust_flag = 'Y'
    GROUP BY
        c.c_preferred_cust_flag
) preferred ON i.i_class = preferred.avg_net_sales
LEFT JOIN (
    SELECT
        c.c_preferred_cust_flag,
        AVG(ss.ss_sales_price * ss.ss_quantity) AS avg_net_sales
    FROM
        store_sales ss
    JOIN
        customer c ON ss.ss_customer_sk = c.c_customer_sk
    JOIN
        item i ON ss.ss_item_sk = i.i_item_sk
    WHERE
        c.c_preferred_cust_flag = 'N'
    GROUP BY
        c.c_preferred_cust_flag
) non_preferred ON i.i_class = non_preferred.avg_net_sales
ORDER BY
    preferred_avg_net_sales DESC,
    i.i_class;
Attempt 1/3 failed with syntax error: Binder Error: Referenced table "p" not found!
Candidate tables: "preferred", "non_preferred"

      i_class  preferred_avg_net_sales  non_preferred_avg_net_sales
0      accent                      0.0                          0.0
1      accent                      0.0                          0.0
2      accent                      0.0                          0.0
3      accent                      0.0                          0.0
4      accent                      0.0                          0.0
...       ...                      ...                          ...
17995    None                      0.0                          0.0
17996    None                      0.0                          0.0
17997    None                      0.0                          0.0
17998    None                      0.0                          0.0
17999    None                      0.0                          0.0

[18000 rows x 3 columns]

Execution: SUCCESS

Execution Time: 39.10 seconds
 ###############################
Question 20: show all stores net sales , average net sales and percentage of net sales compared to average net sales for each store, ordered by percentage of net sales descending.
SELECT
  st.s_store_name AS store_name,
  COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales,
  AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER() AS average_net_sales,
  (COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) / NULLIF(AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER(), 0) * 100 AS percentage_of_net_sales
FROM
  (SELECT
       st.s_store_name,
       SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS ss
FULL OUTER JOIN
  (SELECT
       st.s_store_name,
       SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS sr
ON ss.s_store_name = sr.s_store_name
ORDER BY
  percentage_of_net_sales DESC;
SELECT
  st.s_store_name AS store_name,
  COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales,
  AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER() AS average_net_sales,
  (COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) / NULLIF(AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER(), 0) * 100 AS percentage_of_net_sales
FROM
  (SELECT
       st.s_store_name,
       SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS ss
FULL OUTER JOIN
  (SELECT
       st.s_store_name,
       SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS sr
ON ss.s_store_name = sr.s_store_name
ORDER BY
  percentage_of_net_sales DESC;
Attempt 1/3 failed with syntax error: Binder Error: Referenced table "st" not found!
Candidate tables: "ss", "sr"
SELECT
  st.s_store_name AS store_name,
  COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales,
  AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER() AS average_net_sales,
  (COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) / NULLIF(AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER(), 0) * 100 AS percentage_of_net_sales
FROM
  (SELECT
       st.s_store_name,
       SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS ss
FULL OUTER JOIN
  (SELECT
       st.s_store_name,
       SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS sr
ON ss.s_store_name = sr.s_store_name
ORDER BY
  percentage_of_net_sales DESC;
Attempt 2/3 failed with syntax error: Binder Error: Referenced table "st" not found!
Candidate tables: "ss", "sr"
SELECT
  st.s_store_name AS store_name,
  COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales,
  AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER() AS average_net_sales,
  (COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) / NULLIF(AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER(), 0) * 100 AS percentage_of_net_sales
FROM
  (SELECT
       st.s_store_name,
       SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales
    FROM store_sales AS ss
    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS ss
FULL OUTER JOIN
  (SELECT
       st.s_store_name,
       SUM(sr.sr_return_amt) AS total_returns
    FROM store_returns AS sr
    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk
    GROUP BY st.s_store_name) AS sr
ON ss.s_store_name = sr.s_store_name
ORDER BY
  percentage_of_net_sales DESC;
Attempt 3/3 failed with syntax error: Binder Error: Referenced table "st" not found!
Candidate tables: "ss", "sr"

'Max attempts reached. Last error: Binder Error: Referenced table "st" not found!\nCandidate tables: "ss", "sr"'

Execution: FAILED

Execution Time: 56.64 seconds
 ###############################
CPU times: total: 5.53 s
Wall time: 7min 28s

'Successfully processed 20 questions. Results saved to /tmp/llm\\20250510_144904_qwen3_4b.json'

# Check Results

In [10]:
duckdb.sql(f""" from '{output_dir}/*.json' order by nbr,model """).to_view("results")
try:
 duckdb.sql(f""" load excel ;copy results to '{output_dir}/test.xlsx' (format 'xlsx', header 'true', overwrite)  """)
except Exception as e:
    print(f"Error exporting to Excel: {e}")
    print("close the excel file or tey again.")

In [11]:
# Queries with errors
duckdb.sql(""" from results where error_details is not null""")

┌──────────┬─────────────────┬───────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬──────────┬──────────────────────┬──────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│  model   │    timestamp    │  nbr  │                                                                                                                                 question                                                                                                                                  │ duration_s │                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                sql_query                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                │ attempts │        result        │ result_count │                                                          error_details                                                          │
│ varchar  │     varchar     │ int64 │                                                                                                                                  varchar                                                                                                                                  │   double   │                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 varchar                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 │  int64   │ map(varchar, json)[] │    int64     │                                                             varchar                                                             │
├──────────┼─────────────────┼───────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┼─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼──────────┼──────────────────────┼──────────────┼─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│ gpt-4o   │ 20250510_144904 │    11 │ What is the net sales for each store name, order by net sales.                                                                                                                                                                                                            │      12.38 │ -- What is the net sales for each store name, order by net sales.\nWITH store_sales_agg AS (\n    SELECT\n        st.s_store_name,\n        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales\n    FROM store_sales AS ss\n    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk\n    GROUP BY st.s_store_name\n), store_returns_agg AS (\n    SELECT\n        st.s_store_name,\n        SUM(sr.sr_return_amt) AS total_returns\n    FROM store_returns AS sr\n    INNER JOIN store AS st ON sr.s_store_sk = st.s_store_sk\n    GROUP BY st.s_store_name\n)\nSELECT\n    COALESCE(ss.s_store_name, sr.s_store_name) AS store_name,\n    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales -- Using the net_sales logic\nFROM store_sales_agg AS ss\nFULL OUTER JOIN store_returns_agg AS sr ON ss.s_store_name = sr.s_store_name\nORDER BY net_sales;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                │        3 │ []                   │            0 │ Execution Error: Max attempts reached. Last error: Binder Error: Referenced table "sr" not found!\nCandidate tables: "ss"       │
│ qwen3:4b │ 20250510_144904 │    11 │ What is the net sales for each store name, order by net sales.                                                                                                                                                                                                            │      31.59 │ SELECT\n    st.s_store_name,\n    COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales\nFROM (\n    SELECT\n        s_store_name,\n        SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales\n    FROM store_sales ss\n    INNER JOIN store st ON ss.ss_store_sk = st.s_store_sk\n    GROUP BY s_store_name\n) ss\nFULL OUTER JOIN (\n    SELECT\n        s_store_name,\n        SUM(sr.sr_return_amt) AS total_returns\n    FROM store_returns sr\n    INNER JOIN store st ON sr.sr_store_sk = st.s_store_sk\n    GROUP BY s_store_name\n) sr ON ss.s_store_name = sr.s_store_name\nORDER BY net_sales;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       │        3 │ []                   │            0 │ Execution Error: Max attempts reached. Last error: Binder Error: Referenced table "st" not found!\nCandidate tables: "ss", "sr" │
│ qwen3:4b │ 20250510_144904 │    18 │ Which item brand has shown the largest decrease in its return rate when comparing the average rate of 2001 to 2002, specifically for stores located in the 'TN' state? (Order by the decrease in return rate descending, and then by brand name alphabetically for ties). │     122.17 │ SELECT\n  i.i_brand,\n  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100\n   FROM store_sales ss\n   JOIN store s ON ss.ss_store_sk = s.s_store_sk\n   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk\n   JOIN item i ON ss.ss_item_sk = i.i_item_sk\n   WHERE s.s_state = 'TN' AND d.d_year = 2001\n   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2001,\n  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100\n   FROM store_sales ss\n   JOIN store s ON ss.ss_store_sk = s.s_store_sk\n   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk\n   JOIN item i ON ss.ss_item_sk = i.i_item_sk\n   WHERE s.s_state = 'TN' AND d.d_year = 2002\n   AND ss.ss_item_sk = i.i_item_sk) AS avg_return_rate_2002,\n  (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100\n   FROM store_sales ss\n   JOIN store s ON ss.ss_store_sk = s.s_store_sk\n   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk\n   JOIN item i ON ss.ss_item_sk = i.i_item_sk\n   WHERE s.s_state = 'TN' AND d.d_year = 2001\n   AND ss.ss_item_sk = i.i_item_sk) - (SELECT AVG(sr.sr_return_amt / NULLIF(ss.total_sales, 0)) * 100\n   FROM store_sales ss\n   JOIN store s ON ss.ss_store_sk = s.s_store_sk\n   JOIN date_dim d ON ss.ss_sold_date_sk = d.d_date_sk\n   JOIN item i ON ss.ss_item_sk = i.i_item_sk\n   WHERE s.s_state = 'TN' AND d.d_year = 2002\n   AND ss.ss_item_sk = i.i_item_sk) AS decrease_in_return_rate\nFROM item i\nWHERE i.i_item_sk IN (\n  SELECT DISTINCT ss.ss_item_sk\n  FROM store_sales ss\n  JOIN store s ON ss.ss_store_sk = s.s_store_sk\n  WHERE s.s_state = 'TN' AND ss.ss_sold_date_sk IN (\n    SELECT d.d_date_sk\n    FROM date_dim d\n    WHERE d.d_year = 2001\n  )\n)\nORDER BY decrease_in_return_rate DESC, i.i_brand; │        3 │ []                   │            0 │ Execution Error: Max attempts reached. Last error: Binder Error: Referenced table "ss" not found!\nCandidate tables: "i"        │
│ qwen3:4b │ 20250510_144904 │    20 │ show all stores net sales , average net sales and percentage of net sales compared to average net sales for each store, ordered by percentage of net sales descending.                                                                                                    │      56.64 │ SELECT\n  st.s_store_name AS store_name,\n  COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0) AS net_sales,\n  AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER() AS average_net_sales,\n  (COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) / NULLIF(AVG(COALESCE(ss.total_sales, 0) - COALESCE(sr.total_returns, 0)) OVER(), 0) * 100 AS percentage_of_net_sales\nFROM\n  (SELECT\n       st.s_store_name,\n       SUM(ss.ss_sales_price * ss.ss_quantity) AS total_sales\n    FROM store_sales AS ss\n    INNER JOIN store AS st ON ss.ss_store_sk = st.s_store_sk\n    GROUP BY st.s_store_name) AS ss\nFULL OUTER JOIN\n  (SELECT\n       st.s_store_name,\n       SUM(sr.sr_return_amt) AS total_returns\n    FROM store_returns AS sr\n    INNER JOIN store AS st ON sr.sr_store_sk = st.s_store_sk\n    GROUP BY st.s_store_name) AS sr\nON ss.s_store_name = sr.s_store_name\nORDER BY\n  percentage_of_net_sales DESC;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             │        3 │ []                   │            0 │ Execution Error: Max attempts reached. Last error: Binder Error: Referenced table "st" not found!\nCandidate tables: "ss", "sr" │

In [12]:
# queries where the number of columns resturened by each model is not the same or the number of rows is not the same
duckdb.sql(f""" select nbr from results group by all having count(distinct(cardinality(result[1]))) > 1 or count(distinct(result_count )) > 1 order by nbr """).show(max_width=250)

┌───────┐
│  nbr  │
│ int64 │
├───────┤
│     5 │
│     7 │
│     9 │
│    12 │
│    13 │
│    14 │
│    15 │
│    16 │
│    17 │
│    18 │
│    19 │
│    20 │
└───────┘

In [13]:
# check number of rows returned by each model
duckdb.sql(f""" pivot( select nbr,question,model,result_count from results) on model using min(result_count ) order by nbr""").show(max_width=120)

┌───────┬──────────────────────────────────────────────────────────────────────────────────────────┬────────┬──────────┐
│  nbr  │                                         question                                         │ gpt-4o │ qwen3:4b │
│ int64 │                                         varchar                                          │ int64  │  int64   │
├───────┼──────────────────────────────────────────────────────────────────────────────────────────┼────────┼──────────┤
│     1 │ What is the overall total sales revenue?                                                 │      1 │        1 │
│     2 │ What is the total number of items sold across all transactions?                          │      1 │        1 │
│     3 │ What is the total monetary value of all returned items?                                  │      1 │        1 │
│     4 │ List the names of all stores, order by store name.                                       │     12 │       12 │
│     5 │ What are the different item categories available? Order alphabetically by category name. │     11 │    18000 │
│     6 │ Show total sales revenue for each year, ordered chronologically by year.                 │      6 │        6 │
│     7 │ Which store generated the most total sales revenue? (To ensure a deterministic result …  │      1 │        6 │
│     8 │ What is the total quantity of items sold, broken down by item brand? Order by quantity…  │    713 │      713 │
│     9 │ Compare total sales from preferred customers versus non-preferred customers, ordered b…  │      3 │        2 │
│    10 │ What is the total return amount for each city where stores are located, ordered alphab…  │      2 │        2 │
│    11 │ What is the net sales for each store name, order by net sales.                           │      0 │        0 │
│    12 │ Calculate the return rate for each item category, ordered alphabetically by item categ…  │     12 │       12 │
│    13 │ What is the monthly trend of net sales during the year 2001, ordere by net sales.        │     12 │      365 │
│    14 │ Which customer birth country exhibits the highest average return rate Order by average…  │    213 │      212 │
│    15 │ List all item product names that have a return rate greater than 5% and their total sa…  │   8861 │        0 │
│    16 │ For each store, what was the percentage change in net sales between two consecutive re…  │     30 │        6 │
│    17 │ What is the return rate for items sold on weekends versus weekdays, broken down by cus…  │      6 │       12 │
│    18 │ Which item brand has shown the largest decrease in its return rate when comparing the …  │    698 │        0 │
│    19 │ For each item class, compare the average net sales value per sales transaction between…  │    300 │    18000 │
│    20 │ show all stores net sales , average net sales and percentage of net sales compared to …  │      6 │        0 │
├───────┴──────────────────────────────────────────────────────────────────────────────────────────┴────────┴──────────┤
│ 20 rows                                                                                                    4 columns │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

In [14]:
# check number of columns returned by each model
duckdb.sql(f""" pivot( select nbr,model,result from results) on model using min(MAP_KEYS(result[1]) ) order by nbr""").show(max_width=250)

┌───────┬─────────────────────────────────────────────────────────────────────────┬───────────────────────────────────────────────────────────────────────────┐
│  nbr  │                                 gpt-4o                                  │                                 qwen3:4b                                  │
│ int64 │                                varchar[]                                │                                 varchar[]                                 │
├───────┼─────────────────────────────────────────────────────────────────────────┼───────────────────────────────────────────────────────────────────────────┤
│     1 │ [total_sales_revenue]                                                   │ [total_sales]                                                             │
│     2 │ [total_quantity]                                                        │ [total_quantity]                                                          │
│     3 │ [total_returns]                                                         │ [total_returns]                                                           │
│     4 │ [store_name]                                                            │ [s_store_name]                                                            │
│     5 │ [i_category]                                                            │ [i_category]                                                              │
│     6 │ [year, total_sales]                                                     │ [year, total_sales]                                                       │
│     7 │ [store_name, total_sales]                                               │ [s_store_name, total_sales]                                               │
│     8 │ [brand, total_quantity]                                                 │ [i_brand, total_quantity]                                                 │
│     9 │ [preferred_customer_flag, total_sales]                                  │ [customer_type, total_sales]                                              │
│    10 │ [city, total_returns]                                                   │ [city, total_return_amount]                                               │
│    11 │ NULL                                                                    │ NULL                                                                      │
│    12 │ [item_category, total_sales, total_returns, return_rate]                │ [i_category, return_rate]                                                 │
│    13 │ [month, net_sales]                                                      │ [month, net_sales]                                                        │
│    14 │ [birth_country, total_sales, total_returns, average_return_rate]        │ [c_birth_country, average_return_rate]                                    │
│    15 │ [product_name, total_sales, return_rate]                                │ NULL                                                                      │
│    16 │ [store_name, year, prev_year_net_sales, net_sales, percentage_change]   │ [s_store_name, percentage_change]                                         │
│    17 │ [customer_age_group, day_type, total_sales, total_returns, return_rate] │ [customer_age_group, total_sales, total_returns, return_rate, is_weekend] │
│    18 │ [brand_name, return_rate_2001, return_rate_2002, return_rate_decrease]  │ NULL                                                                      │
│    19 │ [item_class, preferred_customer_flag, avg_net_sales_per_transaction]    │ [i_class, preferred_avg_net_sales, non_preferred_avg_net_sales]           │
│    20 │ [store_name, net_sales, average_net_sales, percentage_of_net_sales]     │ NULL                                                                      │
├───────┴─────────────────────────────────────────────────────────────────────────┴───────────────────────────────────────────────────────────────────────────┤
│ 20 rows                                                                                                                                           3 columns │
└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

Manual check for smilar results ( same rows and columns)

In [15]:
manual = duckdb.sql("""
   with   zzzzz AS(
    SELECT 
        nbr, 
        model, 
        result
    FROM results 
    WHERE nbr not in ( select nbr from results group by all having count(distinct(cardinality(result[1]))) > 1 or count(distinct(result_count )) > 1 order by nbr))
pivot(from zzzzz ) on model using min(result) order by nbr
""")
manual.show(max_width=250)
try:
 duckdb.sql(f""" load excel ;copy manual to '{output_dir}/check.xlsx' (format 'xlsx', header 'true', overwrite)  """)
except Exception as e:
    print(f"Error exporting to Excel: {e}")
    print("close the excel file or tey again.")

┌───────┬──────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│  nbr  │        gpt-4o        │                                                                                                        qwen3:4b                                                                                                         │
│ int64 │ map(varchar, json)[] │                                                                                                  map(varchar, json)[]                                                                                                   │
├───────┼──────────────────────┼─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│     1 │ [{total_sales_reve…  │ [{total_sales=5138665812.53}]                                                                                                                                                                                           │
│     2 │ [{total_quantity=1…  │ [{total_quantity=138963631.0}]                                                                                                                                                                                          │
│     3 │ [{total_returns=27…  │ [{total_returns=270824609.25}]                                                                                                                                                                                          │
│     4 │ [{store_name="able…  │ [{s_store_name="able"}, {s_store_name="able"}, {s_store_name="anti"}, {s_store_name="ation"}, {s_store_name="bar"}, {s_store_name="cally"}, {s_store_name="eing"}, {s_store_name="eing"}, {s_store_name="ese"}, {s_st…  │
│     6 │ [{year=1998, total…  │ [{year=1998, total_sales=1019051668.9}, {year=1999, total_sales=1001288731.68}, {year=2000, total_sales=1024199559.82}, {year=2001, total_sales=1006887594.97}, {year=2002, total_sales=1014023749.92}, {year=2003, t…  │
│     8 │ [{brand="importoed…  │ [{i_brand="importoedu pack #2", total_quantity=2348242.0}, {i_brand="edu packscholar #2", total_quantity=2295358.0}, {i_brand="importoscholar #2", total_quantity=2259448.0}, {i_brand="exportischolar #2", total_qua…  │
│    10 │ [{city="Fairview",…  │ [{city="Fairview", total_return_amount=44308839.18}, {city="Midway", total_return_amount=221569284.52}]                                                                                                                 │
│    11 │ []                   │ []                                                                                                                                                                                                                      │
└───────┴──────────────────────┴─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘